src/Catalogs/СтандартыНаВыбработкуПродукции/СтандартыНаВыбработкуПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтандартыНаВыбработкуПродукции</name>
  <attributes>
    <name>ВидСтандартаНаПродукцию</name>
    <type>
      <types>EnumRef.Базар_ВидыСтандартовНаПродукцию</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/Базар_ВидыСтандартовНаПродукцию/Базар_ВидыСтандартовНаПродукцию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Базар_ВидыСтандартовНаПродукцию</name>
  <enumValues>
    <name>ГОСТ</name>
    <comment>ГОСТ (стандарт - межгосударственный)</comment>
  </enumValues>
  <enumValues>
    <name>ГОСТР</name>
    <comment>ГОСТ Р (стандарт Российской Федерации)</comment>
  </enumValues>
  <enumValues>
    <name>ТУ</name>
    <comment>ТУ (стандарт производителя)</comment>
  </enumValues>
  <enumValues>
    <name>СТО</name>
    <comment>СТО (стандарт отраслевой)</comment>
  </enumValues>
  <enumValues>
    <name>СТБ</name>
    <comment>Стандарт Беларусии</comment>
  </enumValues>
  <enumValues>
    <name>ТРТС</name>
    <comment>ТР/ТС (стандарт Таможенного союза ЕЭС)</comment>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
    <comment>Импортный стандарт</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтандартыНаВыбработкуПродукции/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриИзмененииЗначенияПоляНаСервере()
	Если Объект.ВидСтандартаНаПродукцию = ПредопределенноеЗначение("Перечисление.Базар_ВидыСтандартовНаПродукцию.Импорт") тогда
		Объект.Наименование = СокрЛП(Объект.ВидСтандартаНаПродукцию) + ": " + СокрЛП(Объект.Код);
	Иначе
		Объект.Наименование = СокрЛП(Объект.ВидСтандартаНаПродукцию) + " №" + СокрЛП(Объект.Код);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗначенияПоля(Элемент)
	ПриИзмененииЗначенияПоляНаСервере();
КонецПроцедуры
